# texts.py

TEACHER_COMMANDS = (
    "👩‍🏫 Команды:\n"
    "/addstudent — добавить ученика\n"
    "/addcoins - начислить монетки\n"
    "/add_custom_coins - начислить монетки вручную\n"
    "/top — посмотреть рейтинг\n"
    "/transactions — посмотреть транзакции\n"
    "/removecoins — изъять у ползователя монетку\n"
)

ADMIN_COMMANDS = (
    "🔥 Команды:\n"
    "/addteacher — добавить куратора\n"
    "/removeteacher — удалить куратора\n"
    "/addstudent — добавить ученика\n"
    "/addcoins Имя — начислить монетки\n"
    "/top — посмотреть рейтинг\n"
    "/transactions — посмотреть транзакции\n"
    "/removecoins — изъять у ползовеля монетку\n"
)

STUDENT_COMMANDS = (
    "🧒 Команды:\n"
    "/profile — посмотреть монетки\n"
    "/shop — посмотреть магазин\n"
    "/top — посмотреть рейтинг"
)
